content/programming/emacs/init.org
#+property: header-args :tangle "init.el"
[[file:../../index.org][Giovannis Diary]] > [[file:../../subjects.org][Subjects]] > [[file:../programming.org][Programming]] > [[file:emacs.org][Emacs]] >
#+startup: content indent

* Welcome
#+INDEX: Giovanni's Diary!Programming!Emacs!Init

Hello and welcome to my Emacs configuration file. I use Emacs daily
for a lot of tasks such as coding, writing, reading mailing lists
and blogs, and much more. This file contains my main configuration.

To load this configuration you first need to generate the =.el= via
=C-c C-v C-f= and selecting this file, then load the lisp code with
=M-x load-file=.

* Early Init

This section generates the =early-init.el= file. This code gets
executed very early during emacs' startup sequence.  It is useful to
speedup the startup process.

What I am doing here is to temporarely increase the treshold for the
garbage collector for reduce Its frequency. The value
=most-positive-fixnm= represents the biffest positive integer that
Emacs can handle. After the startup, we want to restore the GC
treshold to a more sane amount, but still bigger than the default
one. I am setting this to 50MB, the default one is 800000 bytes, or
0.79MB.

#+begin_src emacs-lisp :tangle early-init.el
  (setq gc-cons-threshold most-positive-fixnum)

  (add-hook 'emacs-startup-hook
            (lambda () (setq gc-cons-threshold (* 50 1024 1024))))
#+end_src

* Repositories

Those are the usual emacs repositories. Once in a while, you may have
to run =M-x package-refresh-contents= to update the repositories,
expecially if the package manager can find a package but not Its
sources during fetching.

#+begin_src emacs-lisp
(require 'package)
(setq package-archives '(
	     ("GNU" . "http://elpa.gnu.org/packages/")
	     ("MELPA" . "http://melpa.org/packages/")
	     ))
(unless package--initialized (package-initialize))
#+end_src

* Theme

I really like the high-contrast =modus-vivendi= theme which is
built in into emacs. It follows the higher standards of redibility,
they are also well customizable.

You can switch between light and dark mode with =modus-themes-toggle=.
Yes, sometimes I use light mode when I am outside, and I never feel
ashamed about it, I can do whatever I want.

I currently have disabled them because I am using my custom theme (see
below).

#+begin_src emacs-lisp
  ;; (load-theme 'modus-vivendi t)
  ;; ;; Default theme is white, unless the time is after 18 (6 pm)
  ;; (when (< (decoded-time-hour (decode-time)) 18)
  ;;   (modus-themes-toggle))

  ;; (customize-set-variable 'modus-themes-common-palette-overrides
  ;;                         `(
  ;;                           ;; Make the mode-line borderless
  ;;                           (bg-mode-line-active bg-inactive)
  ;;                           (fg-mode-line-active fg-main)
  ;;                           (bg-mode-line-inactive bg-inactive)
  ;;                           (fg-mode-line-inactive fg-dim)
  ;;                           (border-mode-line-active bg-inactive)
  ;;                           (border-mode-line-inactive bg-nactive)
  ;;                           ))
#+end_src

Add the directory for my custom themes:

#+begin_src emacs-lisp
  (setq custom-safe-themes t)
  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
  (load-theme 'giovanni-base)
#+end_src

* Packages
** Use package

I use =use-package= to manage all my packages.

#+begin_src emacs-lisp
(when (< emacs-major-version 29)
  (unless (package-installed-p 'use-package)
    ;;(unless package-archive-contents
     ;; (package-refresh-contents))
    (package-install 'use-package)))
#+end_src

** Xah fly keys

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/lisp")
  (require 'xah-fly-keys)
  (xah-fly-keys-set-layout "qwerty")
  (xah-fly-keys 1)
#+end_src
** Org mode

Org mode settings. I use org mode everywhere in my life.

Run =org-todo= to update a TODO keywork, or =C-c C-t=.
To update completition percentage: =C-c C-c=.
#+begin_src emacs-lisp
    (use-package org
      :ensure nil ; do not try to install it as it is built-in
      :config
      (setq org-todo-keywords
            '((sequence "TODO(t)" "WAIT(w!)" "|" "CANCEL(c!)" "DONE(d!)"))))
  
  ;; Automatically toggle Latex
    (use-package org-fragtog
      :ensure t
      :config
      (setq org-format-latex-options
          '(:foreground "White" 
                        :background "Transparent" 
                        :scale 3.0      ;; Base scaling factor
                        :html-scale 1.5 ;; For HTML export
                        :matchers ("begin" "$1" "$" "$$" "\\(" "\\["))))
    (add-hook 'org-mode-hook 'org-fragtog-mode)
#+end_src
** Markdown mode

I use markdown mode when editing markdown document, mostly on
github because that is the defacto standard format to use.

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t)
#+end_src

