public/programming/emacs/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovannis Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="emacs.html">Emacs</a> &gt;
</p>
<div id="outline-container-orgbec3033" class="outline-2">
<h2 id="orgbec3033">Welcome</h2>
<div class="outline-text-2" id="text-orgbec3033">
<p>
Hello and welcome to my Emacs configuration file. I use Emacs daily
for a lot of tasks such as coding, writing, reading mailing lists
and blogs, and much more. This file contains my main configuration.
</p>

<p>
To load this configuration you first need to generate the <code>.el</code> via
<code>C-c C-v C-f</code> and selecting this file, then load the lisp code with
<code>M-x load-file</code>.
</p>
</div>
</div>
<div id="outline-container-org3e93861" class="outline-2">
<h2 id="org3e93861">Early Init</h2>
<div class="outline-text-2" id="text-org3e93861">
<p>
This section generates the <code>early-init.el</code> file. This code gets
executed very early during emacs' startup sequence.  It is useful to
speedup the startup process.
</p>

<p>
What I am doing here is to temporarely increase the treshold for the
garbage collector for reduce Its frequency. The value
<code>most-positive-fixnm</code> represents the biffest positive integer that
Emacs can handle. After the startup, we want to restore the GC
treshold to a more sane amount, but still bigger than the default
one. I am setting this to 50MB, the default one is 800000 bytes, or
0.79MB.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> gc-cons-threshold most-positive-fixnum)

(add-hook 'emacs-startup-hook
          (<span style="color: #00ffff;">lambda</span> () (<span style="color: #00ffff;">setq</span> gc-cons-threshold (* 50 1024 1024))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc903497" class="outline-2">
<h2 id="orgc903497">Repositories</h2>
<div class="outline-text-2" id="text-orgc903497">
<p>
Those are the usual emacs repositories. Once in a while, you may have
to run <code>M-x package-refresh-contents</code> to update the repositories,
expecially if the package manager can find a package but not Its
sources during fetching.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">package</span>)
(<span style="color: #00ffff;">setq</span> package-archives '(
       (<span style="color: #ffa07a;">"GNU"</span> . <span style="color: #ffa07a;">"http://elpa.gnu.org/packages/"</span>)
       (<span style="color: #ffa07a;">"MELPA"</span> . <span style="color: #ffa07a;">"http://melpa.org/packages/"</span>)
       ))
(<span style="color: #00ffff;">unless</span> package--initialized (package-initialize))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f9fe5a" class="outline-2">
<h2 id="org0f9fe5a">Theme</h2>
<div class="outline-text-2" id="text-org0f9fe5a">
<p>
I really like the high-contrast <code>modus-vivendi</code> theme which is
built in into emacs. It follows the higher standards of redibility,
they are also well customizable.
</p>

<p>
You can switch between light and dark mode with <code>modus-themes-toggle</code>.
Yes, sometimes I use light mode when I am outside, and I never feel
ashamed about it, I can do whatever I want.
</p>

<p>
I currently have disabled them because I am using my custom theme (see
below).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(load-theme 'modus-vivendi t)
</span><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">;; Default theme is white, unless the time is after 18 (6 pm)
</span><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(when (&lt; (decoded-time-hour (decode-time)) 18)
</span><span style="color: #ff7f24;">;;   </span><span style="color: #ff7f24;">(modus-themes-toggle))
</span>
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(customize-set-variable 'modus-themes-common-palette-overrides
</span><span style="color: #ff7f24;">;;                         </span><span style="color: #ff7f24;">`(
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">;; Make the mode-line borderless
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">(bg-mode-line-active bg-inactive)
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">(fg-mode-line-active fg-main)
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">(bg-mode-line-inactive bg-inactive)
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">(fg-mode-line-inactive fg-dim)
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">(border-mode-line-active bg-inactive)
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">(border-mode-line-inactive bg-nactive)
</span><span style="color: #ff7f24;">;;                           </span><span style="color: #ff7f24;">))</span>
</pre>
</div>

<p>
Add the directory for my custom themes:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> custom-safe-themes t)
(add-to-list 'custom-theme-load-path <span style="color: #ffa07a;">"~/.emacs.d/themes/"</span>)
(load-theme 'giovanni-base)
</pre>
</div>
</div>
</div>
<div id="outline-container-org470fb99" class="outline-2">
<h2 id="org470fb99">Packages</h2>
<div class="outline-text-2" id="text-org470fb99">
</div>
<div id="outline-container-org98dcf92" class="outline-3">
<h3 id="org98dcf92">Use package</h3>
<div class="outline-text-3" id="text-org98dcf92">
<p>
I use <code>use-package</code> to manage all my packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">when</span> (&lt; emacs-major-version 29)
  (<span style="color: #00ffff;">unless</span> (package-installed-p 'use-package)
    <span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(unless package-archive-contents
</span>     <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(package-refresh-contents))
</span>    (package-install 'use-package)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org900bd2e" class="outline-3">
<h3 id="org900bd2e">Xah fly keys</h3>
<div class="outline-text-3" id="text-org900bd2e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #ffa07a;">"~/.emacs.d/lisp"</span>)
(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">xah-fly-keys</span>)
(xah-fly-keys-set-layout <span style="color: #ffa07a;">"qwerty"</span>)
(xah-fly-keys 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc30b0cd" class="outline-3">
<h3 id="orgc30b0cd">Org mode</h3>
<div class="outline-text-3" id="text-orgc30b0cd">
<p>
Org mode settings. I use org mode everywhere in my life.
</p>

<p>
Run <code>org-todo</code> to update a TODO keywork, or <code>C-c C-t</code>.
To update completition percentage: <code>C-c C-c</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  (<span style="color: #00ffff;">use-package</span> org
    <span style="color: #b0c4de;">:ensure</span> nil <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">do not try to install it as it is built-in
</span>    <span style="color: #b0c4de;">:config</span>
    (<span style="color: #00ffff;">setq</span> org-todo-keywords
          '((sequence <span style="color: #ffa07a;">"TODO(t)"</span> <span style="color: #ffa07a;">"WAIT(w!)"</span> <span style="color: #ffa07a;">"|"</span> <span style="color: #ffa07a;">"CANCEL(c!)"</span> <span style="color: #ffa07a;">"DONE(d!)"</span>))))

<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Automatically toggle Latex
</span>  (<span style="color: #00ffff;">use-package</span> org-fragtog
    <span style="color: #b0c4de;">:ensure</span> t
    <span style="color: #b0c4de;">:config</span>
    (<span style="color: #00ffff;">setq</span> org-format-latex-options
        '(<span style="color: #b0c4de;">:foreground</span> <span style="color: #ffa07a;">"White"</span> 
                      <span style="color: #b0c4de;">:background</span> <span style="color: #ffa07a;">"Transparent"</span> 
                      <span style="color: #b0c4de;">:scale</span> 3.0      <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Base scaling factor
</span>                      <span style="color: #b0c4de;">:html-scale</span> 1.5 <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">For HTML export
</span>                      <span style="color: #b0c4de;">:matchers</span> (<span style="color: #ffa07a;">"begin"</span> <span style="color: #ffa07a;">"$1"</span> <span style="color: #ffa07a;">"$"</span> <span style="color: #ffa07a;">"$$"</span> <span style="color: #ffa07a;">"</span><span style="color: #ffa07a; font-weight: bold;">\\</span><span style="color: #ffa07a; font-weight: bold;">(</span><span style="color: #ffa07a;">"</span> <span style="color: #ffa07a;">"\\["</span>))))
  (add-hook 'org-mode-hook 'org-fragtog-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf80a3bf" class="outline-3">
<h3 id="orgf80a3bf">Markdown mode</h3>
<div class="outline-text-3" id="text-orgf80a3bf">
<p>
I use markdown mode when editing markdown document, mostly on
github because that is the defacto standard format to use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> markdown-mode
  <span style="color: #b0c4de;">:ensure</span> t)
</pre>
</div>
</div>
</div>
