content/programming/emacs/init.org
** ggtags

GNU Global on emacs.

Shortcuts:
- =C-c f=: jump to definition.

#+begin_src emacs-lisp
  (use-package ggtags
    :ensure t
    :config
    (global-set-key (kbd "C-c f") 'ggtags-find-definition))
#+end_src

** Which-key

This package displays the key bindings following an incomplete
command, very useful if you do not remember one of the few shortcuts
that you can use.

#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :hook (after-init . which-key-mode))
#+end_src

** Ivy

Ivy is a generic completition mechanism for emacs.

#+begin_src emacs-lisp
  (use-package ivy
    :ensure t
    :hook (after-init . ivy-mode)
    :config
    (setopt ivy-use-virtual-buffers t)
    (setopt enable-recursive-minibuffers t)
    (setopt ivy-count-format "(%d/%d) "))
#+end_src

** Avy

Jump to visible text using a char-based decision tree. Lovely!

#+begin_src emacs-lisp
  (use-package avy
    :ensure t)
  ;; Alternative way of setting a keybinding:
  ;;(global-set-key (kbd "C-:") 'avy-goto-char)
#+end_src

** Multiple cursors

#+begin_src emacs-lisp
  (use-package multiple-cursors
    :ensure t)
  (global-set-key (kbd "C-S-c C-S-c") 'mc/edit-lines)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
#+end_src

** Diff-hl

Highlights uncommitted changes on the left of the buffer window.

#+begin_src emacs-lisp
  (use-package diff-hl
    :ensure t
    :hook (after-init . global-diff-hl-mode))
#+end_src

** Emms

Emms is an emacs music player. You either need vlc or mpv as a
backend.

#+begin_src emacs-lisp
  (use-package emms
    :ensure t
    :hook (after-init . emms-all)
    :config
    (setq emms-source-file-default-directory "~/music/")
    (setq emms-browser-music-directory "~/music/")
    (setq emms-player-list '(emms-player-mpv))
    (setq emms-info-functions '(emms-info-native)))
 #+end_src
 
** Gnus

THE best email / rss client. I read all my mailing lists and blogs
here.

Some useful shortcuts:
- =t=: topic view
- =T n=: create a new topic
- =T m=: move to topic
- =^=: list sources
- =u=: subscribe / unsubscribe to source
- =A u=: show all sources
- =G R=: register a new rss feed

#+begin_src emacs-lisp
  (use-package gnus
      :ensure t
      :config
      (setq gnus-directory "~/.emacs.d/news/")
      (setq gnus-home-directory "~/.emacs.d/")
      (setq gnus-startup-file "~/.emacs.d/.newsrc")
      (setq gnus-current-startup-file "~/.emacs.d/.newsrc")
      (setq gnus-init-file "~/.emacs.d/")

      (require 'nnrss)
      (setq gnus-select-method '(nntp "news.gmane.io"))
      (setq gnus-secondary-select-methods
            '((nnrss ""))))
#+end_src

Some blogs use Atom feeds instead of RSS feeds, and Gnus does not
support them by default. To enable atom feeds, you need to install
=xsltproc= (usually packaged by your distribution, for example
=apt-get install xsltproc=). Then load the following code (copied from
the emacs wiki):

#+begin_src emacs-lisp
  (require 'mm-url)
  (defadvice mm-url-insert (after DE-convert-atom-to-rss () )
    "Converts atom to RSS by calling xsltproc."
    (when (re-search-forward "xmlns=\"http://www.w3.org/.*/Atom\"" 
           nil t)
      (goto-char (point-min))
      (message "Converting Atom to RSS... ")
      (call-process-region (point-min) (point-max) 
         "xsltproc" 
         t t nil 
         (expand-file-name "~/.emacs.d/atom2rss.xsl") "-")
      (goto-char (point-min))
      (message "Converting Atom to RSS... done")))

  (ad-activate 'mm-url-insert)
#+end_src

** Yasnippet

Create macros "snippets" for text, I use them often. The snippets are
stored in the directory =snippets/=. To update them, first run
=yas-recompile-all= and then =yas-reload-all=.

#+begin_src emacs-lisp
      (use-package yasnippet
        :ensure t
        :config
        (yas-global-mode 1))
#+end_src

** Olivetti

Center text in the window.

#+begin_src emacs-lisp
  (use-package olivetti
    :ensure t)
#+end_src

** Marginalia

Add commands' description to minibuffer.

#+begin_src emacs-lisp
    (use-package marginalia
      :ensure t
      :hook (after-init . marginalia-mode))
#+end_src

** Nerd-icons

The first time, the user must run =M-x nerd-icons-install-fonts=.

#+begin_src emacs-lisp
  (use-package nerd-icons
    :ensure t)

  (use-package nerd-icons-completion
    :ensure t
    :after marginalia
    :config
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

  (use-package nerd-icons-corfu
    :ensure t
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
  
    (use-package nerd-icons-dired
      :ensure t
      :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

** Swiper

Grep in minibuffer.

#+begin_src emacs-lisp
  (use-package swiper
    :ensure t)
#+end_src

