public/programming/emacs/init.html
<div id="outline-container-org60ad014" class="outline-3">
<h3 id="org60ad014">ggtags</h3>
<div class="outline-text-3" id="text-org60ad014">
<p>
GNU Global on emacs.
</p>

<p>
Shortcuts:
</p>
<ul class="org-ul">
<li><code>C-c f</code>: jump to definition.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> ggtags
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (global-set-key (kbd <span style="color: #ffa07a;">"C-c f"</span>) 'ggtags-find-definition))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd2df5c5" class="outline-3">
<h3 id="orgd2df5c5">Which-key</h3>
<div class="outline-text-3" id="text-orgd2df5c5">
<p>
This package displays the key bindings following an incomplete
command, very useful if you do not remember one of the few shortcuts
that you can use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> which-key
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:hook</span> (after-init . which-key-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org295d0c0" class="outline-3">
<h3 id="org295d0c0">Ivy</h3>
<div class="outline-text-3" id="text-org295d0c0">
<p>
Ivy is a generic completition mechanism for emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> ivy
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:hook</span> (after-init . ivy-mode)
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setopt</span> ivy-use-virtual-buffers t)
  (<span style="color: #00ffff;">setopt</span> enable-recursive-minibuffers t)
  (<span style="color: #00ffff;">setopt</span> ivy-count-format <span style="color: #ffa07a;">"(%d/%d) "</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org526fbbf" class="outline-3">
<h3 id="org526fbbf">Avy</h3>
<div class="outline-text-3" id="text-org526fbbf">
<p>
Jump to visible text using a char-based decision tree. Lovely!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> avy
  <span style="color: #b0c4de;">:ensure</span> t)
<span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Alternative way of setting a keybinding:
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(global-set-key (kbd "C-:") 'avy-goto-char)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd4cb64" class="outline-3">
<h3 id="orgcd4cb64">Multiple cursors</h3>
<div class="outline-text-3" id="text-orgcd4cb64">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> multiple-cursors
  <span style="color: #b0c4de;">:ensure</span> t)
(global-set-key (kbd <span style="color: #ffa07a;">"C-S-c C-S-c"</span>) 'mc/edit-lines)
(global-set-key (kbd <span style="color: #ffa07a;">"C-&gt;"</span>) 'mc/mark-next-like-this)
(global-set-key (kbd <span style="color: #ffa07a;">"C-&lt;"</span>) 'mc/mark-previous-like-this)
(global-set-key (kbd <span style="color: #ffa07a;">"C-c C-&lt;"</span>) 'mc/mark-all-like-this)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8ed699c" class="outline-3">
<h3 id="org8ed699c">Diff-hl</h3>
<div class="outline-text-3" id="text-org8ed699c">
<p>
Highlights uncommitted changes on the left of the buffer window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> diff-hl
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:hook</span> (after-init . global-diff-hl-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeef76a5" class="outline-3">
<h3 id="orgeef76a5">Emms</h3>
<div class="outline-text-3" id="text-orgeef76a5">
<p>
Emms is an emacs music player. You either need vlc or mpv as a
backend.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> emms
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:hook</span> (after-init . emms-all)
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> emms-source-file-default-directory <span style="color: #ffa07a;">"~/music/"</span>)
  (<span style="color: #00ffff;">setq</span> emms-browser-music-directory <span style="color: #ffa07a;">"~/music/"</span>)
  (<span style="color: #00ffff;">setq</span> emms-player-list '(emms-player-mpv))
  (<span style="color: #00ffff;">setq</span> emms-info-functions '(emms-info-native)))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc9f5a42" class="outline-3">
<h3 id="orgc9f5a42">Gnus</h3>
<div class="outline-text-3" id="text-orgc9f5a42">
<p>
THE best email / rss client. I read all my mailing lists and blogs
here.
</p>

<p>
Some useful shortcuts:
</p>
<ul class="org-ul">
<li><code>t</code>: topic view</li>
<li><code>T n</code>: create a new topic</li>
<li><code>T m</code>: move to topic</li>
<li><code>^</code>: list sources</li>
<li><code>u</code>: subscribe / unsubscribe to source</li>
<li><code>A u</code>: show all sources</li>
<li><code>G R</code>: register a new rss feed</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> gnus
    <span style="color: #b0c4de;">:ensure</span> t
    <span style="color: #b0c4de;">:config</span>
    (<span style="color: #00ffff;">setq</span> gnus-directory <span style="color: #ffa07a;">"~/.emacs.d/news/"</span>)
    (<span style="color: #00ffff;">setq</span> gnus-home-directory <span style="color: #ffa07a;">"~/.emacs.d/"</span>)
    (<span style="color: #00ffff;">setq</span> gnus-startup-file <span style="color: #ffa07a;">"~/.emacs.d/.newsrc"</span>)
    (<span style="color: #00ffff;">setq</span> gnus-current-startup-file <span style="color: #ffa07a;">"~/.emacs.d/.newsrc"</span>)
    (<span style="color: #00ffff;">setq</span> gnus-init-file <span style="color: #ffa07a;">"~/.emacs.d/"</span>)

    (<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">nnrss</span>)
    (<span style="color: #00ffff;">setq</span> gnus-select-method '(nntp <span style="color: #ffa07a;">"news.gmane.io"</span>))
    (<span style="color: #00ffff;">setq</span> gnus-secondary-select-methods
          '((nnrss <span style="color: #ffa07a;">""</span>))))
</pre>
</div>

<p>
Some blogs use Atom feeds instead of RSS feeds, and Gnus does not
support them by default. To enable atom feeds, you need to install
<code>xsltproc</code> (usually packaged by your distribution, for example
<code>apt-get install xsltproc</code>). Then load the following code (copied from
the emacs wiki):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">mm-url</span>)
(<span style="color: #00ffff;">defadvice</span> <span style="color: #87cefa;">mm-url-insert</span> (after DE-convert-atom-to-rss () )
  <span style="color: #ffa07a;">"Converts atom to RSS by calling xsltproc."</span>
  (<span style="color: #00ffff;">when</span> (re-search-forward <span style="color: #ffa07a;">"xmlns=\"http://www.w3.org/.*/Atom\""</span> 
         nil t)
    (goto-char (point-min))
    (message <span style="color: #ffa07a;">"Converting Atom to RSS... "</span>)
    (call-process-region (point-min) (point-max) 
       <span style="color: #ffa07a;">"xsltproc"</span> 
       t t nil 
       (expand-file-name <span style="color: #ffa07a;">"~/.emacs.d/atom2rss.xsl"</span>) <span style="color: #ffa07a;">"-"</span>)
    (goto-char (point-min))
    (message <span style="color: #ffa07a;">"Converting Atom to RSS... done"</span>)))

(ad-activate 'mm-url-insert)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8dc2777" class="outline-3">
<h3 id="org8dc2777">Yasnippet</h3>
<div class="outline-text-3" id="text-org8dc2777">
<p>
Create macros "snippets" for text, I use them often. The snippets are
stored in the directory <code>snippets/</code>. To update them, first run
<code>yas-recompile-all</code> and then <code>yas-reload-all</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> yasnippet
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (yas-global-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9e8eaa" class="outline-3">
<h3 id="orgb9e8eaa">Olivetti</h3>
<div class="outline-text-3" id="text-orgb9e8eaa">
<p>
Center text in the window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> olivetti
  <span style="color: #b0c4de;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org2484e63" class="outline-3">
<h3 id="org2484e63">Marginalia</h3>
<div class="outline-text-3" id="text-org2484e63">
<p>
Add commands' description to minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> marginalia
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:hook</span> (after-init . marginalia-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org36b9045" class="outline-3">
<h3 id="org36b9045">Nerd-icons</h3>
<div class="outline-text-3" id="text-org36b9045">
<p>
The first time, the user must run <code>M-x nerd-icons-install-fonts</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> nerd-icons
  <span style="color: #b0c4de;">:ensure</span> t)

(<span style="color: #00ffff;">use-package</span> nerd-icons-completion
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:after</span> marginalia
  <span style="color: #b0c4de;">:config</span>
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(<span style="color: #00ffff;">use-package</span> nerd-icons-corfu
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:after</span> corfu
  <span style="color: #b0c4de;">:config</span>
  (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

  (<span style="color: #00ffff;">use-package</span> nerd-icons-dired
    <span style="color: #b0c4de;">:ensure</span> t
    <span style="color: #b0c4de;">:hook</span> (dired-mode . nerd-icons-dired-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdc39e0d" class="outline-3">
<h3 id="orgdc39e0d">Swiper</h3>
<div class="outline-text-3" id="text-orgdc39e0d">
<p>
Grep in minibuffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> swiper
  <span style="color: #b0c4de;">:ensure</span> t)
</pre>
</div>
</div>
</div>
