content/programming/emacs/init.org
** Ox-publish + simple-httpd

Generate static websites from org-mode.

#+begin_src emacs-lisp
  ;;(use-package ox-publish
  ;;  :ensure t)
  (use-package simple-httpd
    :ensure t)
#+end_src

** auto-complete

Available by default in emacs 30.
#+begin_src emacs-lisp
  (when (< emacs-major-version 30)
    (use-package auto-complete
      :ensure t
      :hook (after-init . global-auto-complete-mode)))
#+end_src

** Flycheck

Modern on-the-fly syntax checking extension for GNU Emacs.

#+begin_src emacs-lisp
  (use-package flycheck
    :ensure
    :commands flycheck-mode
    :config
    (setq flycheck-check-syntax-automatically
          '(save mode-enabled))
    :hook (flycheck-error-list-mode-hook . visual-line-mode))
#+end_src

** rfc-mode

Browse and read RFC documents.

#+begin_src emacs-lisp
  (use-package rfc-mode
    :ensure t
    :config
    (setq rfc-mode-directory (expand-file-name "~/.emacs.d/rfc/")))
#+end_src

* Customization

** Movement

#+begin_src emacs-lisp
  (keymap-global-set "C-s" #'isearch-forward-regexp)
  (keymap-global-set "C-:" #'avy-goto-char-timer)
#+end_src

** Cleanup the screen
 
 #+begin_src emacs-lisp
   (menu-bar-mode -1)
   (scroll-bar-mode -1)
   (tool-bar-mode -1)
   (display-time-mode 1)
#+end_src

** Startup screen

#+begin_src emacs-lisp
   (setq-default inhibit-startup-screen t)
   (setq inhibit-splash-screen t)
   (setq inhibit-startup-message t)
   (setq initial-scratch-message "")
#+end_src

** Dired

#+begin_src emacs-lisp
(use-package dired
  :hook ((dired-mode . dired-hide-details-mode)))
#+end_src

** Line numbers

#+begin_src emacs-lisp
   (global-display-line-numbers-mode)
   (setq display-line-numbers 'relative)
#+end_src

** Time

#+begin_src emacs-lisp
  (setq display-time-format "%I:%M")
#+end_src

** Battery

  #+begin_src emacs-lisp
    (require 'battery)
    (when (and battery-status-function
               (not (string-match-p "N/A"
                                    (battery-format "%B"
                                                    (funcall battery-status-function)))))
      (display-battery-mode 1))
    #+end_src

** Font
    
#+begin_src emacs-lisp
    (set-face-attribute 'default nil :height 130)
#+end_src

** TLS

#+begin_src emacs-lisp
  (setq-default gnutls-trustfiles (list "~/.emacs.d/cacert.pem"
                                       "/etc/pki/tls/certs/ca-bundle.pem"))
#+end_src

** Column Line

#+begin_src emacs-lisp
  (global-display-fill-column-indicator-mode 1)
  (setq global-display-fill-column-indicator-column 80)
#+end_src

** Clean ~ files

#+begin_src emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backup"))
    backup-by-copying t    ; Don't delink hardlinks
    version-control t      ; Use version numbers on backups
    delete-old-versions t  ; Automatically delete excess backups
    kept-new-versions 20   ; how many of the newest versions to keep
    kept-old-versions 5    ; and how many of the old
   )
#+end_src

** Move Autogenerated Code

Emacs has a graphical interface to configure emacs. The generated
code should live in a separate file.

#+begin_src emacs-lisp
(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file :no-error-if-file-is-missing)
#+end_src

** Tabs size

Change the tab size as 2 spaces.

#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
#+end_src
** Coding

Recognize =.inl= files as cpp files.

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.inl\\'" . c++-mode))
#+end_src

** Writer mode

Enter a minimal zen writer mode.

#+begin_src emacs-lisp
  (defun writer-mode-enable ()
    (interactive)
    (olivetti-mode 1)
    (display-line-numbers-mode 0)
    (global-display-fill-column-indicator-mode 0)
    (global-diff-hl-mode 0)
    (display-time-mode 0)
    (display-battery-mode 0))

  (defun writer-mode-disable ()
    (interactive)
    (olivetti-mode 0)
    (display-line-numbers-mode 1)
    (global-display-fill-column-indicator-mode 1)
    (global-diff-hl-mode 1)
    (display-time-mode 1)
    (display-battery-mode 1))
#+end_src

* Shortcuts

#+begin_src emacs-lisp
  (global-set-key (kbd "C-c c") 'compile)
  (global-set-key (kbd "C-c v") 'modus-themes-toggle)
#+end_src

