public/programming/emacs/init.html
<div id="outline-container-org47a0baa" class="outline-3">
<h3 id="org47a0baa">Ox-publish + simple-httpd</h3>
<div class="outline-text-3" id="text-org47a0baa">
<p>
Generate static websites from org-mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(use-package ox-publish
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">:ensure t)
</span>(<span style="color: #00ffff;">use-package</span> simple-httpd
  <span style="color: #b0c4de;">:ensure</span> t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org2504916" class="outline-3">
<h3 id="org2504916">auto-complete</h3>
<div class="outline-text-3" id="text-org2504916">
<p>
Available by default in emacs 30.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">when</span> (&lt; emacs-major-version 30)
  (<span style="color: #00ffff;">use-package</span> auto-complete
    <span style="color: #b0c4de;">:ensure</span> t
    <span style="color: #b0c4de;">:hook</span> (after-init . global-auto-complete-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org33f7df8" class="outline-3">
<h3 id="org33f7df8">Flycheck</h3>
<div class="outline-text-3" id="text-org33f7df8">
<p>
Modern on-the-fly syntax checking extension for GNU Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> flycheck
  <span style="color: #b0c4de;">:ensure</span>
  <span style="color: #b0c4de;">:commands</span> flycheck-mode
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> flycheck-check-syntax-automatically
        '(save mode-enabled))
  <span style="color: #b0c4de;">:hook</span> (flycheck-error-list-mode-hook . visual-line-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org358859c" class="outline-3">
<h3 id="org358859c">rfc-mode</h3>
<div class="outline-text-3" id="text-org358859c">
<p>
Browse and read RFC documents.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> rfc-mode
  <span style="color: #b0c4de;">:ensure</span> t
  <span style="color: #b0c4de;">:config</span>
  (<span style="color: #00ffff;">setq</span> rfc-mode-directory (expand-file-name <span style="color: #ffa07a;">"~/.emacs.d/rfc/"</span>)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7a52d41" class="outline-2">
<h2 id="org7a52d41">Customization</h2>
<div class="outline-text-2" id="text-org7a52d41">
</div>
<div id="outline-container-org3b78fbb" class="outline-3">
<h3 id="org3b78fbb">Movement</h3>
<div class="outline-text-3" id="text-org3b78fbb">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(keymap-global-set <span style="color: #ffa07a;">"C-s"</span> #'isearch-forward-regexp)
(keymap-global-set <span style="color: #ffa07a;">"C-:"</span> #'avy-goto-char-timer)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4cf8c3" class="outline-3">
<h3 id="orgb4cf8c3">Cleanup the screen</h3>
<div class="outline-text-3" id="text-orgb4cf8c3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(display-time-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb02eb7f" class="outline-3">
<h3 id="orgb02eb7f">Startup screen</h3>
<div class="outline-text-3" id="text-orgb02eb7f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq-default</span> inhibit-startup-screen t)
(<span style="color: #00ffff;">setq</span> inhibit-splash-screen t)
(<span style="color: #00ffff;">setq</span> inhibit-startup-message t)
(<span style="color: #00ffff;">setq</span> initial-scratch-message <span style="color: #ffa07a;">""</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgff94dd7" class="outline-3">
<h3 id="orgff94dd7">Dired</h3>
<div class="outline-text-3" id="text-orgff94dd7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">use-package</span> dired
  <span style="color: #b0c4de;">:hook</span> ((dired-mode . dired-hide-details-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org59d6e9c" class="outline-3">
<h3 id="org59d6e9c">Line numbers</h3>
<div class="outline-text-3" id="text-org59d6e9c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-display-line-numbers-mode)
(<span style="color: #00ffff;">setq</span> display-line-numbers 'relative)
</pre>
</div>
</div>
</div>
<div id="outline-container-org26bafea" class="outline-3">
<h3 id="org26bafea">Time</h3>
<div class="outline-text-3" id="text-org26bafea">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> display-time-format <span style="color: #ffa07a;">"%I:%M"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga973393" class="outline-3">
<h3 id="orga973393">Battery</h3>
<div class="outline-text-3" id="text-orga973393">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">require</span> '<span style="color: #7fffd4;">battery</span>)
(<span style="color: #00ffff;">when</span> (<span style="color: #00ffff;">and</span> battery-status-function
           (not (string-match-p <span style="color: #ffa07a;">"N/A"</span>
                                (battery-format <span style="color: #ffa07a;">"%B"</span>
                                                (funcall battery-status-function)))))
  (display-battery-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgeee07c3" class="outline-3">
<h3 id="orgeee07c3">Font</h3>
<div class="outline-text-3" id="text-orgeee07c3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(set-face-attribute 'default nil <span style="color: #b0c4de;">:height</span> 130)
</pre>
</div>
</div>
</div>
<div id="outline-container-org982c758" class="outline-3">
<h3 id="org982c758">TLS</h3>
<div class="outline-text-3" id="text-org982c758">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq-default</span> gnutls-trustfiles (list <span style="color: #ffa07a;">"~/.emacs.d/cacert.pem"</span>
                                     <span style="color: #ffa07a;">"/etc/pki/tls/certs/ca-bundle.pem"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2e61b37" class="outline-3">
<h3 id="org2e61b37">Column Line</h3>
<div class="outline-text-3" id="text-org2e61b37">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-display-fill-column-indicator-mode 1)
(<span style="color: #00ffff;">setq</span> global-display-fill-column-indicator-column 80)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7059e5d" class="outline-3">
<h3 id="org7059e5d">Clean ~ files</h3>
<div class="outline-text-3" id="text-org7059e5d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> backup-directory-alist '((<span style="color: #ffa07a;">"."</span> . <span style="color: #ffa07a;">"~/.emacs.d/backup"</span>))
  backup-by-copying t    <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">Don't delink hardlinks
</span>  version-control t      <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">Use version numbers on backups
</span>  delete-old-versions t  <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">Automatically delete excess backups
</span>  kept-new-versions 20   <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">how many of the newest versions to keep
</span>  kept-old-versions 5    <span style="color: #ff7f24;">; </span><span style="color: #ff7f24;">and how many of the old
</span> )
</pre>
</div>
</div>
</div>
<div id="outline-container-orgedc143e" class="outline-3">
<h3 id="orgedc143e">Move Autogenerated Code</h3>
<div class="outline-text-3" id="text-orgedc143e">
<p>
Emacs has a graphical interface to configure emacs. The generated
code should live in a separate file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq</span> custom-file (locate-user-emacs-file <span style="color: #ffa07a;">"custom.el"</span>))
(load custom-file <span style="color: #b0c4de;">:no-error-if-file-is-missing</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4dbfb8" class="outline-3">
<h3 id="orgd4dbfb8">Tabs size</h3>
<div class="outline-text-3" id="text-orgd4dbfb8">
<p>
Change the tab size as 2 spaces.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">setq-default</span> indent-tabs-mode nil)
(<span style="color: #00ffff;">setq-default</span> tab-width 2)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1b76993" class="outline-3">
<h3 id="org1b76993">Coding</h3>
<div class="outline-text-3" id="text-org1b76993">
<p>
Recognize <code>.inl</code> files as cpp files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'auto-mode-alist '(<span style="color: #ffa07a;">"\\.inl\\'"</span> . c++-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcd9e978" class="outline-3">
<h3 id="orgcd9e978">Writer mode</h3>
<div class="outline-text-3" id="text-orgcd9e978">
<p>
Enter a minimal zen writer mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">writer-mode-enable</span> ()
  (<span style="color: #00ffff;">interactive</span>)
  (olivetti-mode 1)
  (display-line-numbers-mode 0)
  (global-display-fill-column-indicator-mode 0)
  (global-diff-hl-mode 0)
  (display-time-mode 0)
  (display-battery-mode 0))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">writer-mode-disable</span> ()
  (<span style="color: #00ffff;">interactive</span>)
  (olivetti-mode 0)
  (display-line-numbers-mode 1)
  (global-display-fill-column-indicator-mode 1)
  (global-diff-hl-mode 1)
  (display-time-mode 1)
  (display-battery-mode 1))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc65f5c6" class="outline-2">
<h2 id="orgc65f5c6">Shortcuts</h2>
<div class="outline-text-2" id="text-orgc65f5c6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #ffa07a;">"C-c c"</span>) 'compile)
(global-set-key (kbd <span style="color: #ffa07a;">"C-c v"</span>) 'modus-themes-toggle)
</pre>
</div>
</div>
