content/programming/emacs/init.org
** Open Links

Open a web link from cursor position or selected region.
Thank you Sacha Chua!

#+begin_src emacs-lisp
  (defcustom my-search-web-handler "https://duckduckgo.com/html/?q="
    "How to search. Could be a string that accepts the search query at the end (URL-encoded)
  or a function that accepts the text (unencoded)."
    :type '(choice (string :tag "Prefix URL to search engine.")
                   (function :tag "Handler function.")))

  (defun my-open-url-or-search-web (&optional text-or-url)
    (interactive (list (if (region-active-p)
                           (buffer-substring (region-beginning) (region-end))
                         (or
                          (and (derived-mode-p 'org-mode)
                               (let ((elem (org-element-context)))
                                 (and (eq (org-element-type elem) 'link)
                                      (buffer-substring-no-properties
                                       (org-element-begin elem)
                                       (org-element-end elem)))))
                          (thing-at-point 'url)
                          (thing-at-point 'email)
                          (thing-at-point 'filename)
                          (thing-at-point 'word)))))
      (catch 'done
        (let (list)
          (with-temp-buffer
            (insert text-or-url)
            (org-mode)
            (goto-char (point-min))
            ;; We add all the links to a list first because following them may change the point
            (while (re-search-forward org-any-link-re nil t)
              (add-to-list 'list (match-string-no-properties 0)))
            (when list
              (dolist (link list)
                (org-link-open-from-string link))
              (throw 'done list))
            ;; Try emails
            (while (re-search-forward thing-at-point-email-regexp nil t)
              (add-to-list 'list (match-string-no-properties 0)))
            (when list
              (compose-mail (string-join list ", "))
              (throw 'done list)))
          ;; Open filename if specified, or do a web search
          (cond
           ((ffap-guesser) (find-file-at-point))
           ((functionp my-search-web-handler)
            (funcall my-search-web-handler text-or-url))
           ((stringp my-search-web-handler)
            (browse-url (concat my-search-web-handler (url-hexify-string text-or-url))))))))

  (keymap-global-set "C-c o" #'my-open-url-or-search-web)
#+end_src

** copy-line

https://www.emacswiki.org/emacs/CopyingWholeLines

#+begin_src emacs-lisp
  (defun copy-line (arg)
    "Copy lines (as many as prefix argument) in the kill ring.
    Ease of use features:
    - Move to start of next line.
    - Appends the copy on sequential calls.
    - Use newline as last char even on the last line of the buffer.
    - If region is active, copy its lines."
    (interactive "p")
    (let ((beg (line-beginning-position))
          (end (line-end-position arg)))
      (when mark-active
        (if (> (point) (mark))
            (setq beg (save-excursion (goto-char (mark)) (line-beginning-position)))
          (setq end (save-excursion (goto-char (mark)) (line-end-position)))))
      (if (eq last-command 'copy-line)
          (kill-append (buffer-substring beg end) (< end beg))
        (kill-ring-save beg end)))
    (kill-append "\n" nil)
    (beginning-of-line (or (and arg (1+ arg)) 2))
    (if (and arg (not (= 1 arg))) (message "%d lines copied" arg)))

  (keymap-global-set "C-c l" #'copy-line)
#+end_src

* Depricated
** Undo Tree

Show and manage history as a tree of changes.
Try =undo-tree-visualize=.

#+begin_src emacs-lisp
;;(require 'undo-tree)
;;(global-undo-tree-mode)
#+end_src

** Obsidian

I dont use this anymore. Also, It did not work.

#+begin_src emacs-lisp
  ;;(require 'obsidian)
  ;;(obsidian-specify-path "~/ObsidianVault")
#+end_src

** Elfeed

Local Rss feed reader. I like it and It works fine, but I moved
to gnus.

#+begin_src emacs-lisp
  ;;(require 'elfeed)
  ;;(require 'elfeed-dashboard)
  ;;(setq elfeed-feeds
  ;;      '("http://www.kroah.com/log/index.rss"
  ;;        "https://www.dragonflydigest.com/feed/"
  ;;        "https://protesilaos.com/master.xml"
  ;;        "http://feeds.feedburner.com/linuxquestions/latest"))
#+end_src

** PDF Reader

#+begin_src emacs-lisp
  ;;(pdf-tools-install)
  ;;(pdf-loader-install)
#+end_src

** LSP

Who needs a language server, pff.

#+begin_src emacs-lisp
  ;; LSP
  ;;(require 'lsp-mode)
  ;;(require 'helm-lsp)
  ;;(require 'helm-mode)
  ;;(require 'helm-xref)
#+end_src

** C3

Sometime I use this, but It does not belong in the main init file.

#+begin_src emacs-lisp
  ;; Language highlight
  ;;(setq treesit-language-source-alist
  ;;  '((c3 "https://github.com/c3lang/tree-sitter-c3")))

  ;;(add-to-list 'load-path "~/.emacs.d/c3-ts-mode")
  ;;(require 'c3-ts-mode)
#+end_src
