public/programming/emacs/init.html
<div id="outline-container-orgdb865fd" class="outline-3">
<h3 id="orgdb865fd">Open Links</h3>
<div class="outline-text-3" id="text-orgdb865fd">
<p>
Open a web link from cursor position or selected region.
Thank you Sacha Chua!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defcustom</span> <span style="color: #eedd82;">my-search-web-handler</span> <span style="color: #ffa07a;">"https://duckduckgo.com/html/?q="</span>
  <span style="color: #ffa07a;">"How to search. Could be a string that accepts the search query at the end (URL-encoded)
or a function that accepts the text (unencoded)."</span>
  <span style="color: #b0c4de;">:type</span> '(choice (string <span style="color: #b0c4de;">:tag</span> <span style="color: #ffa07a;">"Prefix URL to search engine."</span>)
                 (<span style="color: #00ffff;">function</span> <span style="color: #b0c4de;">:tag</span> <span style="color: #ffa07a;">"Handler function."</span>)))

(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">my-open-url-or-search-web</span> (<span style="color: #98fb98;">&amp;optional</span> text-or-url)
  (<span style="color: #00ffff;">interactive</span> (list (<span style="color: #00ffff;">if</span> (region-active-p)
                         (buffer-substring (region-beginning) (region-end))
                       (<span style="color: #00ffff;">or</span>
                        (<span style="color: #00ffff;">and</span> (derived-mode-p 'org-mode)
                             (<span style="color: #00ffff;">let</span> ((elem (org-element-context)))
                               (<span style="color: #00ffff;">and</span> (eq (org-element-type elem) 'link)
                                    (buffer-substring-no-properties
                                     (org-element-begin elem)
                                     (org-element-end elem)))))
                        (thing-at-point 'url)
                        (thing-at-point 'email)
                        (thing-at-point 'filename)
                        (thing-at-point 'word)))))
    (<span style="color: #00ffff;">catch</span> '<span style="color: #7fffd4;">done</span>
      (<span style="color: #00ffff;">let</span> (list)
        (<span style="color: #00ffff;">with-temp-buffer</span>
          (insert text-or-url)
          (org-mode)
          (goto-char (point-min))
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">We add all the links to a list first because following them may change the point
</span>          (<span style="color: #00ffff;">while</span> (re-search-forward org-any-link-re nil t)
            (add-to-list 'list (match-string-no-properties 0)))
          (<span style="color: #00ffff;">when</span> list
            (<span style="color: #00ffff;">dolist</span> (link list)
              (org-link-open-from-string link))
            (<span style="color: #00ffff;">throw</span> '<span style="color: #7fffd4;">done</span> list))
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Try emails
</span>          (<span style="color: #00ffff;">while</span> (re-search-forward thing-at-point-email-regexp nil t)
            (add-to-list 'list (match-string-no-properties 0)))
          (<span style="color: #00ffff;">when</span> list
            (compose-mail (string-join list <span style="color: #ffa07a;">", "</span>))
            (<span style="color: #00ffff;">throw</span> '<span style="color: #7fffd4;">done</span> list)))
        <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Open filename if specified, or do a web search
</span>        (<span style="color: #00ffff;">cond</span>
         ((ffap-guesser) (find-file-at-point))
         ((functionp my-search-web-handler)
          (funcall my-search-web-handler text-or-url))
         ((stringp my-search-web-handler)
          (browse-url (concat my-search-web-handler (url-hexify-string text-or-url))))))))

(keymap-global-set <span style="color: #ffa07a;">"C-c o"</span> #'my-open-url-or-search-web)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6d975c1" class="outline-3">
<h3 id="org6d975c1">copy-line</h3>
<div class="outline-text-3" id="text-org6d975c1">
<p>
<a href="https://www.emacswiki.org/emacs/CopyingWholeLines">https://www.emacswiki.org/emacs/CopyingWholeLines</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">copy-line</span> (arg)
  <span style="color: #ffa07a;">"Copy lines (as many as prefix argument) in the kill ring.
  Ease of use features:
  - Move to start of next line.
  - Appends the copy on sequential calls.
  - Use newline as last char even on the last line of the buffer.
  - If region is active, copy its lines."</span>
  (<span style="color: #00ffff;">interactive</span> <span style="color: #ffa07a;">"p"</span>)
  (<span style="color: #00ffff;">let</span> ((beg (line-beginning-position))
        (end (line-end-position arg)))
    (<span style="color: #00ffff;">when</span> mark-active
      (<span style="color: #00ffff;">if</span> (&gt; (point) (mark))
          (<span style="color: #00ffff;">setq</span> beg (<span style="color: #00ffff;">save-excursion</span> (goto-char (mark)) (line-beginning-position)))
        (<span style="color: #00ffff;">setq</span> end (<span style="color: #00ffff;">save-excursion</span> (goto-char (mark)) (line-end-position)))))
    (<span style="color: #00ffff;">if</span> (eq last-command 'copy-line)
        (kill-append (buffer-substring beg end) (&lt; end beg))
      (kill-ring-save beg end)))
  (kill-append <span style="color: #ffa07a;">"\n"</span> nil)
  (beginning-of-line (<span style="color: #00ffff;">or</span> (<span style="color: #00ffff;">and</span> arg (1+ arg)) 2))
  (<span style="color: #00ffff;">if</span> (<span style="color: #00ffff;">and</span> arg (not (= 1 arg))) (message <span style="color: #ffa07a;">"%d lines copied"</span> arg)))

(keymap-global-set <span style="color: #ffa07a;">"C-c l"</span> #'copy-line)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1f42c02" class="outline-2">
<h2 id="org1f42c02">Depricated</h2>
<div class="outline-text-2" id="text-org1f42c02">
</div>
<div id="outline-container-org77dec89" class="outline-3">
<h3 id="org77dec89">Undo Tree</h3>
<div class="outline-text-3" id="text-org77dec89">
<p>
Show and manage history as a tree of changes.
Try <code>undo-tree-visualize</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'undo-tree)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(global-undo-tree-mode)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf52c9a0" class="outline-3">
<h3 id="orgf52c9a0">Obsidian</h3>
<div class="outline-text-3" id="text-orgf52c9a0">
<p>
I dont use this anymore. Also, It did not work.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'obsidian)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(obsidian-specify-path "~/ObsidianVault")</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgebd7c84" class="outline-3">
<h3 id="orgebd7c84">Elfeed</h3>
<div class="outline-text-3" id="text-orgebd7c84">
<p>
Local Rss feed reader. I like it and It works fine, but I moved
to gnus.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'elfeed)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'elfeed-dashboard)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(setq elfeed-feeds
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">'("http://www.kroah.com/log/index.rss"
</span><span style="color: #ff7f24;">;;        </span><span style="color: #ff7f24;">"https://www.dragonflydigest.com/feed/"
</span><span style="color: #ff7f24;">;;        </span><span style="color: #ff7f24;">"https://protesilaos.com/master.xml"
</span><span style="color: #ff7f24;">;;        </span><span style="color: #ff7f24;">"http://feeds.feedburner.com/linuxquestions/latest"))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org07eff41" class="outline-3">
<h3 id="org07eff41">PDF Reader</h3>
<div class="outline-text-3" id="text-org07eff41">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(pdf-tools-install)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(pdf-loader-install)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd179e0" class="outline-3">
<h3 id="orgdd179e0">LSP</h3>
<div class="outline-text-3" id="text-orgdd179e0">
<p>
Who needs a language server, pff.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">LSP
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'lsp-mode)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'helm-lsp)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'helm-mode)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'helm-xref)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org207d0dc" class="outline-3">
<h3 id="org207d0dc">C3</h3>
<div class="outline-text-3" id="text-org207d0dc">
<p>
Sometime I use this, but It does not belong in the main init file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Language highlight
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(setq treesit-language-source-alist
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">'((c3 "https://github.com/c3lang/tree-sitter-c3")))
</span>
<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(add-to-list 'load-path "~/.emacs.d/c3-ts-mode")
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'c3-ts-mode)</span>
</pre>
</div>
</div>
</div>
