content/programming/emacs/init.org
** Evil

I am happy to say that I don't use evil anymore, the transition
is now complete.

#+begin_src emacs-lisp
;;  (use-package evil
;;    :ensure t)
#+end_src
** Save Session

#+begin_src emacs-lisp
;;(desktop-save-mode 1)
#+end_src

** hledger
An Emacs major mode for writing hledger journals and generating useful
accounting reports.

The external hledger program should be installed first, or most of the
report features won't work.
#+begin_src emacs-lisp
;;  (use-package hledger-mode
;;    :ensure
;;    :config
;;    (add-to-list 'auto-mode-alist '("\\.journal\\'" . hledger-mode))
;;    (setq hledger-jfile "/home/santo/todo.org/expenses.journal")
;;    (global-set-key (kbd "C-c j") 'hledger-run-command))
#+end_src

** org-roam

#+begin_src emacs-lisp
  ;; (use-package org-roam
  ;;  :ensure t
  ;;  :custom
  ;;  (org-roam-directory "/home/santo/giovanni-diary/content")
  ;;  :init
  ;;  (setq org-roam-v2-ack t) ;; acknowledge v2
  ;;  :config
  ;;  (org-roam-db-autosync-mode))
#+end_src

#+begin_src emacs-lisp
  ;; (use-package org-roam-ui
  ;;   :ensure t
  ;;   :after org-roam
  ;;   :hook (after-init . org-roam-ui-mode)
  ;;   :config
  ;;   (setq org-roam-ui-sync-theme t
  ;;         org-roam-ui-follow t
  ;;         org-roam-ui-update-on-save t
          ;; org-roam-ui-open-on-start t))
#+end_src

