public/programming/emacs/init.html
<div id="outline-container-orgf62f4f2" class="outline-3">
<h3 id="orgf62f4f2">Evil</h3>
<div class="outline-text-3" id="text-orgf62f4f2">
<p>
I am happy to say that I don't use evil anymore, the transition
is now complete.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(use-package evil
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">:ensure t)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e898b2" class="outline-3">
<h3 id="org7e898b2">Save Session</h3>
<div class="outline-text-3" id="text-org7e898b2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(desktop-save-mode 1)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org36b1d6f" class="outline-3">
<h3 id="org36b1d6f">hledger</h3>
<div class="outline-text-3" id="text-org36b1d6f">
<p>
An Emacs major mode for writing hledger journals and generating useful
accounting reports.
</p>

<p>
The external hledger program should be installed first, or most of the
report features won't work.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(use-package hledger-mode
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">:ensure
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">:config
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">(add-to-list 'auto-mode-alist '("\\.journal\\'" . hledger-mode))
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">(setq hledger-jfile "/home/santo/todo.org/expenses.journal")
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">(global-set-key (kbd "C-c j") 'hledger-run-command))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5bb89ba" class="outline-3">
<h3 id="org5bb89ba">org-roam</h3>
<div class="outline-text-3" id="text-org5bb89ba">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(use-package org-roam
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">:ensure t
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">:custom
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(org-roam-directory "/home/santo/giovanni-diary/content")
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">:init
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(setq org-roam-v2-ack t) ;; acknowledge v2
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">:config
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(org-roam-db-autosync-mode))</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(use-package org-roam-ui
</span><span style="color: #ff7f24;">;;   </span><span style="color: #ff7f24;">:ensure t
</span><span style="color: #ff7f24;">;;   </span><span style="color: #ff7f24;">:after org-roam
</span><span style="color: #ff7f24;">;;   </span><span style="color: #ff7f24;">:hook (after-init . org-roam-ui-mode)
</span><span style="color: #ff7f24;">;;   </span><span style="color: #ff7f24;">:config
</span><span style="color: #ff7f24;">;;   </span><span style="color: #ff7f24;">(setq org-roam-ui-sync-theme t
</span><span style="color: #ff7f24;">;;         </span><span style="color: #ff7f24;">org-roam-ui-follow t
</span><span style="color: #ff7f24;">;;         </span><span style="color: #ff7f24;">org-roam-ui-update-on-save t
</span>        <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">org-roam-ui-open-on-start t))</span>
</pre>
</div>
</div>
</div>
