public/programming/emacs/init.html
<div id="outline-container-org5d26e04" class="outline-3">
<h3 id="org5d26e04">EXWM</h3>
<div class="outline-text-3" id="text-org5d26e04">
<p>
Emacs' X window manager. I have used this for a while, but
sometimes emacs would bug and It needed to be restarted. With
EXWM, this means closing everything and starting again, which
is unfortunate. So I changed to the good old i3 and now I am
a heppy human being.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">############## EXWM BEGIN ##################
</span><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Emac's X window manager, works fine
</span>
<span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">(require 'exwm)
</span>  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Set the default number of workspaces
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(setq exwm-workspace-number 5)
</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">When window "class" updates, use it to set the buffer name
</span>  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">(add-hook 'exwm-update-class-hook #'efs/exwm-update-class)
</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">These keys should always pass through to Emacs
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(setq exwm-input-prefix-keys
</span><span style="color: #ff7f24;">;;    </span><span style="color: #ff7f24;">'(?\C-x
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\C-u
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\C-h
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\M-x
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\M-`
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\M-&amp;
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\M-:
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\C-\M-j  ;; Buffer list
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">?\C-\ ))  ;; Ctrl+Space
</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Ctrl+Q will enable the next key to be sent directly
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)
</span>
  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Set up global key bindings.  These always work, no matter the input state!
</span>  <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Keep in mind that changing this list after EXWM initializes has no effect.
</span><span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(setq exwm-input-global-keys
</span><span style="color: #ff7f24;">;;       </span><span style="color: #ff7f24;">`(
</span>          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([?\s-r] . exwm-reset)
</span>
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Move between windows
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([s-left] . windmove-left)
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([s-right] . windmove-right)
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([s-up] . windmove-up)
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([s-down] . windmove-down)
</span>
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Launch applications via shell command
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([?\s-&amp;] . (lambda (command)
</span><span style="color: #ff7f24;">;;                       </span><span style="color: #ff7f24;">(interactive (list (read-shell-command "$ ")))
</span><span style="color: #ff7f24;">;;                       </span><span style="color: #ff7f24;">(start-process-shell-command command nil command)))
</span>
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Switch workspace
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([?\s-w] . exwm-workspace-switch)
</span>
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">'</span><span style="color: #7fffd4;">s-N</span><span style="color: #ff7f24;">': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">,@(mapcar (lambda (i)
</span><span style="color: #ff7f24;">;;                      </span><span style="color: #ff7f24;">`(,(kbd (format "s-%d" i)) .
</span><span style="color: #ff7f24;">;;                        </span><span style="color: #ff7f24;">(lambda ()
</span><span style="color: #ff7f24;">;;                          </span><span style="color: #ff7f24;">(interactive)
</span><span style="color: #ff7f24;">;;                          </span><span style="color: #ff7f24;">(exwm-workspace-switch-create ,i))))
</span><span style="color: #ff7f24;">;;                    </span><span style="color: #ff7f24;">(number-sequence 0 9))
</span>
          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Audio keys
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([XF86AudioRaiseVolume] . (lambda ()
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">              (interactive)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">              (shell-command "amixer set Master 5%+")))
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([XF86AudioLowerVolume] . (lambda ()
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">              (interactive)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">              (shell-command "amixer set Master 5%-")))
</span>
<span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([XF86AudioMute] . (lambda()
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">             (interactive)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">             (shell-command "amixer set Master toggle")))
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([XF86AudioMicMute] . (lambda()
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">           (interactive)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">           (shell-command "amixer set Master toggle")))
</span>          <span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">Brightness
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([XF86MonBrightnessUp] . (lambda()
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">           (interactive)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">           (shell-command "echo $(( $(cat /sys/class/backlight/intel_backlight/brightness) + 10000)) &gt; /sys/class/backlight/intel_backlight/brightness")))
</span><span style="color: #ff7f24;">;;          </span><span style="color: #ff7f24;">([XF86MonBrightnessDown] . (lambda()
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">           (interactive)
</span><span style="color: #ff7f24;">;;</span><span style="color: #ff7f24;">           (shell-command "echo $(( $(cat /sys/class/backlight/intel_backlight/brightness) - 10000)) &gt; /sys/class/backlight/intel_backlight/brightness")))
</span><span style="color: #ff7f24;">;;      </span><span style="color: #ff7f24;">))
</span>
<span style="color: #ff7f24;">;;  </span><span style="color: #ff7f24;">(exwm-enable)
</span><span style="color: #ff7f24;">;; </span><span style="color: #ff7f24;">############### EXWM END ##################
</span>
</pre>
</div>

<p>
-e 
</p>
<hr />

<p>
Travel: <a href="emacs.html">Emacs</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
